app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published" = ?  [["published", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def index
    @posts = Post.where(published: true)
    if !params[:search].nil? && params[:search].present?
      @posts = PostSearchService.search(@posts, params[:search])
    end
    render json: @posts.includes(:user), status: :ok # pedir explicación

INSERT INTO "posts" ("title", "content", "published", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Titulo"], ["content", "Contenido"], ["published", 1], ["user_id", 1], ["created_at", "2022-05-09 19:51:57.173365"], ["updated_at", "2022-05-09 19:51:57.173365"]]
---
  def create
    @post = Post.create!(create_params)

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "titulo nuevo"], ["updated_at", "2022-05-09 20:05:59.687245"], ["id", 11]]
---
  def update
    @post = Post.find(params[:id])
    @post.update!(update_params)