app/controllers/concerns/secured.rb

  def authenticate_user!
    # Bearer xxxxxx
    token_regex = /Bearer (\w+)/
    # leer HEADER de auth
    headers = request.headers
    # verificar que sea valido
    if headers['Authorization'].present? && headers['Authorization'].match(token_regex)
      token = headers['Authorization'].match(token_regex)[1]
      # debemos verificar que el token corresponda a un user
      if(Current.user = User.find_by_auth_token(token))
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT ?  [["auth_token", "bc5392085eae6f223374961db23ffbc6"], ["LIMIT", 1]]